MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_flash.h
  * @brief   Header file of FLASH HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_FLASH_H
#define STM32C5XX_HAL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_flash_itf.h"


/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined (FLASH)

/** @defgroup FLASH FLASH
  * @{
  */

/* Exported Constants ------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_Exported_Constants HAL FLASH Constants
  * @{
  */

#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
/** @defgroup FLASH_Error_Code FLASH Error Code
  * @{
  */
#define HAL_FLASH_ERROR_NONE    0UL             /*!< No error during erase or operation          */
#define HAL_FLASH_ERROR_WRP     (0x01UL << 1U)  /*!< Write protection error during operation     */
#define HAL_FLASH_ERROR_PGS     (0x01UL << 3U)  /*!< Programming sequence error during operation */
#define HAL_FLASH_ERROR_STRB    (0x01UL << 5U)  /*!< Strobe error during operation               */
#define HAL_FLASH_ERROR_INC     (0x01UL << 7U)  /*!< Inconsistency error during operation        */


/**
  * @}
  */
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

/**
  * @}
  */

/* Exported Types ----------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_Exported_Types HAL FLASH Types
  * @{
  */

#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
/*! HAL FLASH program mode enumeration definition */
typedef enum
{
  HAL_FLASH_PROGRAM_QUADWORD   = 0x5A5A5A5AU, /*!< FLASH Program Quad-Word mode   */
  HAL_FLASH_PROGRAM_DOUBLEWORD = 0xAAAAAAAAU, /*!< FLASH Program Double-Word mode */
  HAL_FLASH_PROGRAM_WORD       = 0x55555555U, /*!< FLASH Program Word mode        */
  HAL_FLASH_PROGRAM_HALFWORD   = 0xF5F5F5F5U, /*!< FLASH Program Half-Word mode   */
  HAL_FLASH_PROGRAM_BYTE       = 0xEEEEEEEEU, /*!< FLASH Program Byte mode        */
} hal_flash_program_mode_t;
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */

/*! HAL FLASH state enumeration definition */
typedef enum
{
  HAL_FLASH_STATE_RESET       = 0UL,          /*!< FLASH not initialized                       */
  HAL_FLASH_STATE_IDLE        = (1UL << 30U), /*!< FLASH initialized and configured            */
  HAL_FLASH_STATE_ACTIVE      = (1UL << 31U)  /*!< FLASH process operation state               */
} hal_flash_state_t;

/*! HAL FLASH area info structure definition */
typedef struct
{
  uint32_t base_addr;      /*!< FLASH area base address  */
  uint32_t area_size_byte; /*!< FLASH area size in bytes */
  uint16_t page_nbr;       /*!< FLASH number of pages    */
} hal_flash_area_info_t;

/*! HAL FLASH bank info structure definition */
typedef struct
{
  uint8_t area_nbr;                     /*!< FLASH number of areas                          */
  uint32_t bank_size_byte;              /*!< FLASH bank size in bytes                       */
  hal_flash_area_info_t user_flash;     /*!< FLASH user area information structure          */
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
  hal_flash_area_info_t edata_flash;    /*!< FLASH edata area information structure         */
#else
  hal_flash_area_info_t ext_user_flash; /*!< FLASH extended user area information structure */
#endif /* USE_HAL_FLASH_OB_EDATA */
} hal_flash_bank_info_t;


/*! HAL FLASH info structure definition */
typedef struct
{
  uint32_t flash_size_byte;                  /*!< FLASH total size in bytes                  */
  uint8_t bank_nbr;                          /*!< FLASH number of banks                      */
  hal_flash_bank_info_t bank[FLASH_BANK_NB]; /*!< FLASH array of bank information structures */
} hal_flash_info_t;

/*! HAL FLASH interrupted operation enumeration definition */
typedef enum
{
  HAL_FLASH_INTERRUPTED_NO_OPERATION = LL_FLASH_INTERRUPTED_NO_OPERATION, /*!< FLASH interrupted no operation        */
  HAL_FLASH_INTERRUPTED_SINGLE_WRITE = LL_FLASH_INTERRUPTED_SINGLE_WRITE, /*!< FLASH interrupted single write        */
  HAL_FLASH_INTERRUPTED_PAGE_ERASE   = LL_FLASH_INTERRUPTED_PAGE_ERASE,   /*!< FLASH interrupted page erase          */
  HAL_FLASH_INTERRUPTED_BANK_ERASE   = LL_FLASH_INTERRUPTED_BANK_ERASE,   /*!< FLASH interrupted bank erase          */
  HAL_FLASH_INTERRUPTED_MASS_ERASE   = LL_FLASH_INTERRUPTED_MASS_ERASE,   /*!< FLASH interrupted mass erase          */
  HAL_FLASH_INTERRUPTED_OB_CHANGE    = LL_FLASH_INTERRUPTED_OB_CHANGE     /*!< FLASH interrupted option bytes change */
} hal_flash_interrupted_operation_t;

/*! HAL FLASH interrupted operation structure definition */
typedef struct
{
  uint32_t                          addr;        /*!< FLASH interrupted operation address */
  hal_flash_interrupted_operation_t operation;   /*!< FLASH interrupted operation code    */
} hal_flash_interrupted_by_reset_operation_info_t;

#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
/*! HAL FLASH ECC type enumeration definition */
typedef enum
{
  HAL_FLASH_ECC_NONE   = 0U,                     /*!< FLASH ECC no error               */
  HAL_FLASH_ECC_SINGLE = LL_FLASH_FLAG_ECCC,     /*!< FLASH ECC single error detection */
  HAL_FLASH_ECC_DOUBLE = LL_FLASH_FLAG_ECCD      /*!< FLASH ECC double error detection */
} hal_flash_ecc_type_t;

/*! HAL FLASH ECC status enumeration definition */
typedef enum
{
  HAL_FLASH_ECC_NOT_CORRECTED = 0U,     /*!< FLASH ECC not corrected */
  HAL_FLASH_ECC_CORRECTED     = 1U      /*!< FLASH ECC corrected     */
} hal_flash_ecc_status_t;

/*! HAL FLASH ECC information enumeration definition */
typedef struct
{
  hal_flash_ecc_type_t   type;     /*!< FLASH ECC type    */
  hal_flash_ecc_status_t status;   /*!< FLASH ECC status  */
  uint32_t               addr;     /*!< FLASH ECC address */
  uint32_t               data;     /*!< FLASH ECC data    */
} hal_flash_ecc_info_t;
