MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.h
#endif /* USE_HAL_FLASH_ECC */

/*! HAL FLASH operation enumeration definition */
typedef enum
{
  HAL_FLASH_NO_OPERATION = 0U, /*!< FLASH no operation            */
#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
  HAL_FLASH_PROGRAM      = 1U, /*!< FLASH operation program       */
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */
#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
  HAL_FLASH_ADDR_ERASE   = 2U, /*!< FLASH operation address erase */
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */
#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
  HAL_FLASH_PAGE_ERASE   = 3U, /*!< FLASH operation page erase  */
#endif /* USE_HAL_FLASH_ERASE_PAGE */
#if defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)
  HAL_FLASH_BANK_ERASE   = 4U, /*!< FLASH operation bank erase    */
#endif /* USE_HAL_FLASH_ERASE_BANK */
#if defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1)
  HAL_FLASH_MASS_ERASE   = 5U  /*!< FLASH operation mass erase    */
#endif /* USE_HAL_FLASH_MASS_ERASE */
} hal_flash_operation_t;

typedef struct hal_flash_handle_s hal_flash_handle_t; /*!< HAL FLASH handle structure type */

#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
/*! HAL FLASH program unit function pointer definition */
typedef void (*hal_flash_program_unit_func_t)(hal_flash_handle_t *hflash);
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */

#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
/*! HAL FLASH program complete callback pointer definition */
typedef void (*hal_flash_program_cplt_cb_t)(hal_flash_handle_t *hflash, uint32_t addr, uint32_t size_byte);
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
/*! HAL FLASH erase by address complete callback pointer definition */
typedef void (*hal_flash_erase_by_addr_cplt_cb_t)(hal_flash_handle_t *hflash, uint32_t addr, uint32_t size_byte);
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
/*! HAL FLASH erase by page complete callback pointer definition */
typedef void (*hal_flash_erase_page_cplt_cb_t)(hal_flash_handle_t *hflash,
                                               hal_flash_bank_t bank,
                                               uint32_t page,
                                               uint32_t page_nbr);
#endif /* USE_HAL_FLASH_ERASE_PAGE */

#if defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)
/*! HAL FLASH bank erase complete callback pointer definition */
typedef void (*hal_flash_erase_bank_cplt_cb_t)(hal_flash_handle_t *hflash, hal_flash_bank_t bank);
#endif /* USE_HAL_FLASH_ERASE_BANK */

#if defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1)
/*! HAL FLASH mass erase complete callback pointer definition */
typedef void (*hal_flash_mass_erase_cplt_cb_t)(hal_flash_handle_t *hflash);
#endif /* USE_HAL_FLASH_MASS_ERASE */

/*! HAL FLASH error callback pointer definition */
typedef void (*hal_flash_error_cb_t)(hal_flash_handle_t *hflash, hal_flash_bank_t bank);

#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
/*! HAL FLASH ECC error callback pointer definition */
typedef hal_status_t (*hal_flash_ecc_error_cb_t)(hal_flash_handle_t *hflash, hal_flash_bank_t bank);
#endif /* USE_HAL_FLASH_ECC */
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */

/*! HAL FLASH handle structure definition */
struct hal_flash_handle_s
{
  hal_flash_t                       instance;                /*!< FLASH instance                                  */
  volatile hal_flash_state_t        global_state;            /*!< FLASH global state                              */
#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
  hal_flash_program_mode_t          programming_mode;        /*!< FLASH programming mode                          */
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */
  volatile hal_flash_operation_t    ongoing_operation;       /*!< FLASH ongoing operation type                    */
#if (defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)) \
    || (defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1))
  hal_flash_bank_t                 erase_bank;               /*!< FLASH erase bank                                */
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR || USE_HAL_FLASH_ERASE_PAGE
          || USE_HAL_FLASH_ERASE_BANK || USE_HAL_FLASH_MASS_ERASE */
#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
  volatile uint32_t                 last_error_codes;        /*!< FLASH last error codes                          */
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */
#if (defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1))
  volatile uint32_t                 erase_page;              /*!< FLASH erase page                                */
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR || USE_HAL_FLASH_ERASE_PAGE */
#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
  volatile uint32_t                 prog_data_addr;          /*!< FLASH program user data buffer                  */
  volatile uint32_t                 prog_flash_addr;         /*!< FLASH program flash address                     */
  volatile uint32_t                 prog_size_byte;          /*!< FLASH programmed size in bytes                  */
  uint32_t                          is_adaptive_prog;        /*!< FLASH is adaptive programming status            */
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */
#if (defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1))
  uint32_t                          size;                    /*!< FLASH program or erase size byte or page number */
  volatile uint32_t                 count;                   /*!< FLASH program and erase count                   */
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR || USE_HAL_FLASH_ERASE_BY_ADDR || USE_HAL_FLASH_ERASE_PAGE */
#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
  hal_flash_program_unit_func_t     p_prog_unit_func;        /*!< FLASH program unit function                     */
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */
#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
  hal_flash_program_cplt_cb_t       p_program_cplt_cb;       /*!< FLASH program complete callback                 */
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */
#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
  hal_flash_erase_by_addr_cplt_cb_t p_erase_by_addr_cplt_cb; /*!< FLASH erase by address complete callback        */
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */
#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
  hal_flash_erase_page_cplt_cb_t    p_erase_page_cplt_cb;    /*!< FLASH erase page complete callback              */
#endif /* USE_HAL_FLASH_ERASE_PAGE */
#if defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)
  hal_flash_erase_bank_cplt_cb_t    p_erase_bank_cplt_cb;    /*!< FLASH erase bank complete callback              */
#endif /* USE_HAL_FLASH_ERASE_BANK */
#if defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1)
  hal_flash_mass_erase_cplt_cb_t    p_mass_erase_cplt_cb;    /*!< FLASH mass erase complete callback              */
#endif /* USE_HAL_FLASH_MASS_ERASE */
  hal_flash_error_cb_t              p_error_cb;              /*!< FLASH error callback                            */
#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
  hal_flash_ecc_error_cb_t          p_ecc_error_cb;          /*!< FLASH ECC error callback                        */
#endif /* USE_HAL_FLASH_ECC */
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
#if defined(USE_HAL_FLASH_USER_DATA) && (USE_HAL_FLASH_USER_DATA == 1)
  const void                        *p_user_data;            /*!< FLASH user data                                 */
#endif /* USE_HAL_FLASH_USER_DATA */
};
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_Exported_Functions HAL FLASH Functions
  * @{
  */

